Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_i3c.h
#define I3C_CFGR_TSFSET_B_0X0                                           (0x0u<<30)
#define I3C_CFGR_TSFSET_B_0X1                                           (0x1u<<30)
#define I3C_CFGR_FCFDIS_B_0X0                                           (0x0u<<23)
#define I3C_CFGR_FCFDIS_B_0X1                                           (0x1u<<23)
#define I3C_CFGR_CFLUSH_B_0X0                                           (0x0u<<21)
#define I3C_CFGR_CFLUSH_B_0X1                                           (0x1u<<21)
#define I3C_CFGR_CDMAEN_B_0X0                                           (0x0u<<20)
#define I3C_CFGR_CDMAEN_B_0X1                                           (0x1u<<20)
#define I3C_CFGR_TMODE_B_0X0                                            (0x0u<<19)
#define I3C_CFGR_TMODE_B_0X1                                            (0x1u<<19)
#define I3C_CFGR_SMODE_B_0X0                                            (0x0u<<18)
#define I3C_CFGR_SMODE_B_0X1                                            (0x1u<<18)
#define I3C_CFGR_SFLUSH_B_0X0                                           (0x0u<<17)
#define I3C_CFGR_SFLUSH_B_0X1                                           (0x1u<<17)
#define I3C_CFGR_SDMAEN_B_0X0                                           (0x0u<<16)
#define I3C_CFGR_SDMAEN_B_0X1                                           (0x1u<<16)
#define I3C_CFGR_TXTHRES_B_0X0                                          (0x0u<<14)
#define I3C_CFGR_TXTHRES_B_0X1                                          (0x1u<<14)
#define I3C_CFGR_TXFLUSH_B_0X0                                          (0x0u<<13)
#define I3C_CFGR_TXFLUSH_B_0X1                                          (0x1u<<13)
#define I3C_CFGR_TXDMAEN_B_0X0                                          (0x0u<<12)
#define I3C_CFGR_TXDMAEN_B_0X1                                          (0x1u<<12)
#define I3C_CFGR_RXTHRES_B_0X0                                          (0x0u<<10)
#define I3C_CFGR_RXTHRES_B_0X1                                          (0x1u<<10)
#define I3C_CFGR_RXFLUSH_B_0X0                                          (0x0u<<9)
#define I3C_CFGR_RXFLUSH_B_0X1                                          (0x1u<<9)
#define I3C_CFGR_RXDMAEN_B_0X0                                          (0x0u<<8)
#define I3C_CFGR_RXDMAEN_B_0X1                                          (0x1u<<8)
#define I3C_CFGR_HJACK_B_0X0                                            (0x0u<<7)
#define I3C_CFGR_HJACK_B_0X1                                            (0x1u<<7)
#define I3C_CFGR_HKSDAEN_B_0X0                                          (0x0u<<5)
#define I3C_CFGR_HKSDAEN_B_0X1                                          (0x1u<<5)
#define I3C_CFGR_EXITPTRN_B_0X0                                         (0x0u<<4)
#define I3C_CFGR_EXITPTRN_B_0X1                                         (0x1u<<4)
#define I3C_CFGR_RSTPTRN_B_0X0                                          (0x0u<<3)
#define I3C_CFGR_RSTPTRN_B_0X1                                          (0x1u<<3)
#define I3C_CFGR_NOARBH_B_0X0                                           (0x0u<<2)
#define I3C_CFGR_NOARBH_B_0X1                                           (0x1u<<2)
#define I3C_CFGR_CRINIT_B_0X0                                           (0x0u<<1)
#define I3C_CFGR_CRINIT_B_0X1                                           (0x1u<<1)
#define I3C_CFGR_EN_B_0X0                                               (0x0u<<0)
#define I3C_CFGR_EN_B_0X1                                               (0x1u<<0)

// RDR Configuration

#define I3C_RDR_RDB0                                                    (0xFFu<<0)
#define I3C_RDR_RDB0_0                                                  (0x1u<<0)

// RDWR Configuration

#define I3C_RDWR_RDB3                                                   (0xFFu<<24)
#define I3C_RDWR_RDB3_0                                                 (0x1u<<24)
#define I3C_RDWR_RDB2                                                   (0xFFu<<16)
#define I3C_RDWR_RDB2_0                                                 (0x1u<<16)
#define I3C_RDWR_RDB1                                                   (0xFFu<<8)
#define I3C_RDWR_RDB1_0                                                 (0x1u<<8)
#define I3C_RDWR_RDB0                                                   (0xFFu<<0)
#define I3C_RDWR_RDB0_0                                                 (0x1u<<0)

// TDR Configuration

#define I3C_TDR_TDB0                                                    (0xFFu<<0)
#define I3C_TDR_TDB0_0                                                  (0x1u<<0)

// TDWR Configuration

#define I3C_TDWR_TDB3                                                   (0xFFu<<24)
#define I3C_TDWR_TDB3_0                                                 (0x1u<<24)
#define I3C_TDWR_TDB2                                                   (0xFFu<<16)
#define I3C_TDWR_TDB2_0                                                 (0x1u<<16)
#define I3C_TDWR_TDB1                                                   (0xFFu<<8)
#define I3C_TDWR_TDB1_0                                                 (0x1u<<8)
#define I3C_TDWR_TDB0                                                   (0xFFu<<0)
#define I3C_TDWR_TDB0_0                                                 (0x1u<<0)

// IBIDR Configuration

#define I3C_IBIDR_IBIDB3                                                (0xFFu<<24)
#define I3C_IBIDR_IBIDB3_0                                              (0x1u<<24)
#define I3C_IBIDR_IBIDB2                                                (0xFFu<<16)
#define I3C_IBIDR_IBIDB2_0                                              (0x1u<<16)
#define I3C_IBIDR_IBIDB1                                                (0xFFu<<8)
#define I3C_IBIDR_IBIDB1_0                                              (0x1u<<8)
#define I3C_IBIDR_IBIDB0                                                (0xFFu<<0)
#define I3C_IBIDR_IBIDB0_0                                              (0x1u<<0)

// TGTTDR Configuration

#define I3C_TGTTDR_PRELOAD                                              (0x1u<<16)
#define I3C_TGTTDR_TGTTDCNT                                             (0xFFFFu<<0)
#define I3C_TGTTDR_TGTTDCNT_0                                           (0x1u<<0)

#define I3C_TGTTDR_PRELOAD_B_0X0                                        (0x0u<<16)
#define I3C_TGTTDR_PRELOAD_B_0X1                                        (0x1u<<16)

// SR Configuration

#define I3C_SR_MID                                                      (0xFFu<<24)
#define I3C_SR_MID_0                                                    (0x1u<<24)
#define I3C_SR_DIR                                                      (0x1u<<18)
#define I3C_SR_ABT                                                      (0x1u<<17)
#define I3C_SR_XDCNT                                                    (0xFFFFu<<0)
#define I3C_SR_XDCNT_0                                                  (0x1u<<0)

#define I3C_SR_DIR_B_0X0                                                (0x0u<<18)
#define I3C_SR_DIR_B_0X1                                                (0x1u<<18)
#define I3C_SR_ABT_B_0X0                                                (0x0u<<17)
#define I3C_SR_ABT_B_0X1                                                (0x1u<<17)

// SER Configuration

