Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_i3c.h
#define I3C_CEVR_CGRPF_B_0X0                                            (0x0u<<31)
#define I3C_CEVR_CGRPF_B_0X1                                            (0x1u<<31)
#define I3C_CEVR_CDEFF_B_0X0                                            (0x0u<<30)
#define I3C_CEVR_CDEFF_B_0X1                                            (0x1u<<30)
#define I3C_CEVR_CINTUPDF_B_0X0                                         (0x0u<<29)
#define I3C_CEVR_CINTUPDF_B_0X1                                         (0x1u<<29)
#define I3C_CEVR_CASUPDF_B_0X0                                          (0x0u<<28)
#define I3C_CEVR_CASUPDF_B_0X1                                          (0x1u<<28)
#define I3C_CEVR_CRSTF_B_0X0                                            (0x0u<<27)
#define I3C_CEVR_CRSTF_B_0X1                                            (0x1u<<27)
#define I3C_CEVR_CMRLUPDF_B_0X0                                         (0x0u<<26)
#define I3C_CEVR_CMRLUPDF_B_0X1                                         (0x1u<<26)
#define I3C_CEVR_CMWLUPDF_B_0X0                                         (0x0u<<25)
#define I3C_CEVR_CMWLUPDF_B_0X1                                         (0x1u<<25)
#define I3C_CEVR_CDAUPDF_B_0X0                                          (0x0u<<24)
#define I3C_CEVR_CDAUPDF_B_0X1                                          (0x1u<<24)
#define I3C_CEVR_CSTAF_B_0X0                                            (0x0u<<23)
#define I3C_CEVR_CSTAF_B_0X1                                            (0x1u<<23)
#define I3C_CEVR_CGETF_B_0X0                                            (0x0u<<22)
#define I3C_CEVR_CGETF_B_0X1                                            (0x1u<<22)
#define I3C_CEVR_CWKPF_B_0X0                                            (0x0u<<21)
#define I3C_CEVR_CWKPF_B_0X1                                            (0x1u<<21)
#define I3C_CEVR_CHJF_B_0X0                                             (0x0u<<19)
#define I3C_CEVR_CHJF_B_0X1                                             (0x1u<<19)
#define I3C_CEVR_CCRUPDF_B_0X0                                          (0x0u<<18)
#define I3C_CEVR_CCRUPDF_B_0X1                                          (0x1u<<18)
#define I3C_CEVR_CCRF_B_0X0                                             (0x0u<<17)
#define I3C_CEVR_CCRF_B_0X1                                             (0x1u<<17)
#define I3C_CEVR_CIBIENDF_B_0X0                                         (0x0u<<16)
#define I3C_CEVR_CIBIENDF_B_0X1                                         (0x1u<<16)
#define I3C_CEVR_CIBIF_B_0X0                                            (0x0u<<15)
#define I3C_CEVR_CIBIF_B_0X1                                            (0x1u<<15)
#define I3C_CEVR_CERRF_B_0X0                                            (0x0u<<11)
#define I3C_CEVR_CERRF_B_0X1                                            (0x1u<<11)
#define I3C_CEVR_CRXTGTENDF_B_0X0                                       (0x0u<<10)
#define I3C_CEVR_CRXTGTENDF_B_0X1                                       (0x1u<<10)
#define I3C_CEVR_CFCF_B_0X0                                             (0x0u<<9)
#define I3C_CEVR_CFCF_B_0X1                                             (0x1u<<9)

// MISR Configuration

#define I3C_MISR_GRPMIS                                                 (0x1u<<31)
#define I3C_MISR_DEFMIS                                                 (0x1u<<30)
#define I3C_MISR_INTUPDMIS                                              (0x1u<<29)
#define I3C_MISR_ASUPDMIS                                               (0x1u<<28)
#define I3C_MISR_RSTMIS                                                 (0x1u<<27)
#define I3C_MISR_MRLUPDMIS                                              (0x1u<<26)
#define I3C_MISR_MWLUPDMIS                                              (0x1u<<25)
#define I3C_MISR_DAUPDMIS                                               (0x1u<<24)
#define I3C_MISR_STAMIS                                                 (0x1u<<23)
#define I3C_MISR_GETMIS                                                 (0x1u<<22)
#define I3C_MISR_WKPMIS                                                 (0x1u<<21)
#define I3C_MISR_HJMIS                                                  (0x1u<<19)
#define I3C_MISR_CRUPDMIS                                               (0x1u<<18)
#define I3C_MISR_CRMIS                                                  (0x1u<<17)
#define I3C_MISR_IBIENDMIS                                              (0x1u<<16)
#define I3C_MISR_IBIMIS                                                 (0x1u<<15)
#define I3C_MISR_ERRMIS                                                 (0x1u<<11)
#define I3C_MISR_RXTGTENDMIS                                            (0x1u<<10)
#define I3C_MISR_FCMIS                                                  (0x1u<<9)
#define I3C_MISR_RXFNEMIS                                               (0x1u<<5)
#define I3C_MISR_TXFNFMIS                                               (0x1u<<4)
#define I3C_MISR_SFNEMIS                                                (0x1u<<3)
#define I3C_MISR_CFNFMIS                                                (0x1u<<2)

// DEVR0 Configuration

#define I3C_DEVR0_RSTVAL                                                (0x1u<<24)
#define I3C_DEVR0_RSTACT                                                (0x3u<<22)
#define I3C_DEVR0_RSTACT_0                                              (0x1u<<22)
#define I3C_DEVR0_AS                                                    (0x3u<<20)
#define I3C_DEVR0_AS_0                                                  (0x1u<<20)
#define I3C_DEVR0_HJEN                                                  (0x1u<<19)
#define I3C_DEVR0_CREN                                                  (0x1u<<17)
#define I3C_DEVR0_IBIEN                                                 (0x1u<<16)
#define I3C_DEVR0_DA                                                    (0x7Fu<<1)
#define I3C_DEVR0_DA_0                                                  (0x1u<<1)
#define I3C_DEVR0_DAVAL                                                 (0x1u<<0)

#define I3C_DEVR0_RSTACT_B_0X0                                          (0x0u<<22)
#define I3C_DEVR0_RSTACT_B_0X1                                          (0x1u<<22)
#define I3C_DEVR0_RSTACT_B_0X2                                          (0x2u<<22)
#define I3C_DEVR0_RSTACT_B_0X3                                          (0x3u<<22)
#define I3C_DEVR0_AS_B_0X0                                              (0x0u<<20)
#define I3C_DEVR0_AS_B_0X1                                              (0x1u<<20)
#define I3C_DEVR0_AS_B_0X2                                              (0x2u<<20)
#define I3C_DEVR0_AS_B_0X3                                              (0x3u<<20)
#define I3C_DEVR0_HJEN_B_0X0                                            (0x0u<<19)
#define I3C_DEVR0_HJEN_B_0X1                                            (0x1u<<19)
#define I3C_DEVR0_CREN_B_0X0                                            (0x0u<<17)
#define I3C_DEVR0_CREN_B_0X1                                            (0x1u<<17)
#define I3C_DEVR0_IBIEN_B_0X0                                           (0x0u<<16)
#define I3C_DEVR0_IBIEN_B_0X1                                           (0x1u<<16)

