Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_i3c.h
// DEVR1 Configuration

#define I3C_DEVR1_DIS                                                   (0x1u<<31)
#define I3C_DEVR1_SUSP                                                  (0x1u<<19)
#define I3C_DEVR1_IBIDEN                                                (0x1u<<18)
#define I3C_DEVR1_CRACK                                                 (0x1u<<17)
#define I3C_DEVR1_IBIACK                                                (0x1u<<16)
#define I3C_DEVR1_DA                                                    (0x7Fu<<1)
#define I3C_DEVR1_DA_0                                                  (0x1u<<1)

#define I3C_DEVR1_DIS_B_0X0                                             (0x0u<<31)
#define I3C_DEVR1_DIS_B_0X1                                             (0x1u<<31)
#define I3C_DEVR1_SUSP_B_0X0                                            (0x0u<<19)
#define I3C_DEVR1_SUSP_B_0X1                                            (0x1u<<19)
#define I3C_DEVR1_IBIDEN_B_0X0                                          (0x0u<<18)
#define I3C_DEVR1_IBIDEN_B_0X1                                          (0x1u<<18)
#define I3C_DEVR1_CRACK_B_0X0                                           (0x0u<<17)
#define I3C_DEVR1_CRACK_B_0X1                                           (0x1u<<17)
#define I3C_DEVR1_IBIACK_B_0X0                                          (0x0u<<16)
#define I3C_DEVR1_IBIACK_B_0X1                                          (0x1u<<16)

// DEVR2 Configuration

#define I3C_DEVR2_DIS                                                   (0x1u<<31)
#define I3C_DEVR2_SUSP                                                  (0x1u<<19)
#define I3C_DEVR2_IBIDEN                                                (0x1u<<18)
#define I3C_DEVR2_CRACK                                                 (0x1u<<17)
#define I3C_DEVR2_IBIACK                                                (0x1u<<16)
#define I3C_DEVR2_DA                                                    (0x7Fu<<1)
#define I3C_DEVR2_DA_0                                                  (0x1u<<1)

#define I3C_DEVR2_DIS_B_0X0                                             (0x0u<<31)
#define I3C_DEVR2_DIS_B_0X1                                             (0x1u<<31)
#define I3C_DEVR2_SUSP_B_0X0                                            (0x0u<<19)
#define I3C_DEVR2_SUSP_B_0X1                                            (0x1u<<19)
#define I3C_DEVR2_IBIDEN_B_0X0                                          (0x0u<<18)
#define I3C_DEVR2_IBIDEN_B_0X1                                          (0x1u<<18)
#define I3C_DEVR2_CRACK_B_0X0                                           (0x0u<<17)
#define I3C_DEVR2_CRACK_B_0X1                                           (0x1u<<17)
#define I3C_DEVR2_IBIACK_B_0X0                                          (0x0u<<16)
#define I3C_DEVR2_IBIACK_B_0X1                                          (0x1u<<16)

// DEVR3 Configuration

#define I3C_DEVR3_DIS                                                   (0x1u<<31)
#define I3C_DEVR3_SUSP                                                  (0x1u<<19)
#define I3C_DEVR3_IBIDEN                                                (0x1u<<18)
#define I3C_DEVR3_CRACK                                                 (0x1u<<17)
#define I3C_DEVR3_IBIACK                                                (0x1u<<16)
#define I3C_DEVR3_DA                                                    (0x7Fu<<1)
#define I3C_DEVR3_DA_0                                                  (0x1u<<1)

#define I3C_DEVR3_DIS_B_0X0                                             (0x0u<<31)
#define I3C_DEVR3_DIS_B_0X1                                             (0x1u<<31)
#define I3C_DEVR3_SUSP_B_0X0                                            (0x0u<<19)
#define I3C_DEVR3_SUSP_B_0X1                                            (0x1u<<19)
#define I3C_DEVR3_IBIDEN_B_0X0                                          (0x0u<<18)
#define I3C_DEVR3_IBIDEN_B_0X1                                          (0x1u<<18)
#define I3C_DEVR3_CRACK_B_0X0                                           (0x0u<<17)
#define I3C_DEVR3_CRACK_B_0X1                                           (0x1u<<17)
#define I3C_DEVR3_IBIACK_B_0X0                                          (0x0u<<16)
#define I3C_DEVR3_IBIACK_B_0X1                                          (0x1u<<16)

// DEVR4 Configuration

#define I3C_DEVR4_DIS                                                   (0x1u<<31)
#define I3C_DEVR4_SUSP                                                  (0x1u<<19)
#define I3C_DEVR4_IBIDEN                                                (0x1u<<18)
#define I3C_DEVR4_CRACK                                                 (0x1u<<17)
#define I3C_DEVR4_IBIACK                                                (0x1u<<16)
#define I3C_DEVR4_DA                                                    (0x7Fu<<1)
#define I3C_DEVR4_DA_0                                                  (0x1u<<1)

#define I3C_DEVR4_DIS_B_0X0                                             (0x0u<<31)
#define I3C_DEVR4_DIS_B_0X1                                             (0x1u<<31)
#define I3C_DEVR4_SUSP_B_0X0                                            (0x0u<<19)
#define I3C_DEVR4_SUSP_B_0X1                                            (0x1u<<19)
#define I3C_DEVR4_IBIDEN_B_0X0                                          (0x0u<<18)
#define I3C_DEVR4_IBIDEN_B_0X1                                          (0x1u<<18)
#define I3C_DEVR4_CRACK_B_0X0                                           (0x0u<<17)
#define I3C_DEVR4_CRACK_B_0X1                                           (0x1u<<17)
#define I3C_DEVR4_IBIACK_B_0X0                                          (0x0u<<16)
#define I3C_DEVR4_IBIACK_B_0X1                                          (0x1u<<16)

// MAXRLR Configuration

#define I3C_MAXRLR_IBIP                                                 (0x7u<<16)
#define I3C_MAXRLR_IBIP_0                                               (0x1u<<16)
#define I3C_MAXRLR_MRL                                                  (0xFFFFu<<0)
#define I3C_MAXRLR_MRL_0                                                (0x1u<<0)

#define I3C_MAXRLR_IBIP_B_0X0                                           (0x0u<<16)
#define I3C_MAXRLR_IBIP_B_0X1                                           (0x1u<<16)
#define I3C_MAXRLR_IBIP_B_0X2                                           (0x2u<<16)
#define I3C_MAXRLR_IBIP_B_0X3                                           (0x3u<<16)
#define I3C_MAXRLR_IBIP_B_0X4                                           (0x4u<<16)

// MAXWLR Configuration

#define I3C_MAXWLR_MWL                                                  (0xFFFFu<<0)
#define I3C_MAXWLR_MWL_0                                                (0x1u<<0)

// TIMINGR0 Configuration

#define I3C_TIMINGR0_SCLH_I2C                                           (0xFFu<<24)
#define I3C_TIMINGR0_SCLH_I2C_0                                         (0x1u<<24)
#define I3C_TIMINGR0_SCLL_OD                                            (0xFFu<<16)
#define I3C_TIMINGR0_SCLL_OD_0                                          (0x1u<<16)
#define I3C_TIMINGR0_SCLH_I3C                                           (0xFFu<<8)
#define I3C_TIMINGR0_SCLH_I3C_0                                         (0x1u<<8)
#define I3C_TIMINGR0_SCLL_PP                                            (0xFFu<<0)
#define I3C_TIMINGR0_SCLL_PP_0                                          (0x1u<<0)

// TIMINGR1 Configuration

#define I3C_TIMINGR1_SDA_HD                                             (0x3u<<28)
#define I3C_TIMINGR1_SDA_HD_0                                           (0x1u<<28)
#define I3C_TIMINGR1_FREE                                               (0x7Fu<<16)
#define I3C_TIMINGR1_FREE_0                                             (0x1u<<16)
#define I3C_TIMINGR1_ASNCR                                              (0x3u<<8)
#define I3C_TIMINGR1_ASNCR_0                                            (0x1u<<8)
#define I3C_TIMINGR1_AVAL                                               (0xFFu<<0)
#define I3C_TIMINGR1_AVAL_0                                             (0x1u<<0)

// TIMINGR2 Configuration

#define I3C_TIMINGR2_STALL                                              (0xFFu<<8)
#define I3C_TIMINGR2_STALL_0                                            (0x1u<<8)
#define I3C_TIMINGR2_STALLL                                             (0x1u<<6)
#define I3C_TIMINGR2_STALLS                                             (0x1u<<5)
#define I3C_TIMINGR2_STALLR                                             (0x1u<<4)
#define I3C_TIMINGR2_STALLA                                             (0x1u<<3)
#define I3C_TIMINGR2_STALLC                                             (0x1u<<2)
#define I3C_TIMINGR2_STALLD                                             (0x1u<<1)
#define I3C_TIMINGR2_STALLT                                             (0x1u<<0)

#define I3C_TIMINGR2_STALLL_B_0X0                                       (0x0u<<6)
#define I3C_TIMINGR2_STALLL_B_0X1                                       (0x1u<<6)
#define I3C_TIMINGR2_STALLS_B_0X0                                       (0x0u<<5)
#define I3C_TIMINGR2_STALLS_B_0X1                                       (0x1u<<5)
#define I3C_TIMINGR2_STALLR_B_0X0                                       (0x0u<<4)
#define I3C_TIMINGR2_STALLR_B_0X1                                       (0x1u<<4)
#define I3C_TIMINGR2_STALLA_B_0X0                                       (0x0u<<3)
#define I3C_TIMINGR2_STALLA_B_0X1                                       (0x1u<<3)
#define I3C_TIMINGR2_STALLC_B_0X0                                       (0x0u<<2)
#define I3C_TIMINGR2_STALLC_B_0X1                                       (0x1u<<2)
#define I3C_TIMINGR2_STALLD_B_0X0                                       (0x0u<<1)
#define I3C_TIMINGR2_STALLD_B_0X1                                       (0x1u<<1)
#define I3C_TIMINGR2_STALLT_B_0X0                                       (0x0u<<0)
#define I3C_TIMINGR2_STALLT_B_0X1                                       (0x1u<<0)

// BCR Configuration

#define I3C_BCR_BCR6                                                    (0x1u<<6)
#define I3C_BCR_BCR2                                                    (0x1u<<2)
#define I3C_BCR_BCR0                                                    (0x1u<<0)

